# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'fzf'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure


# Development
brew 'mysql'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'go'
brew 'ruby'

# Apps
cask '1password'
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'brave-browser'
cask 'dashlane'
cask 'zoomus'
cask 'github'
cask 'google-chrome'
cask 'java'
cask 'goland'
cask 'slack'
cask 'sublime-text'
cask 'tor-browser'
cask 'spotify'
cask 'sourcetree'
cask 'sequel-pro'
cask 'f.lux'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Magnet', id: 441258766

